Repository: taahirisaacs/woo-conditional-shipping-pro
Catalog: languages/woo-conditional-shipping-*.po
Languages: fi

source: N/A
fi: Ei saatavilla

source: Shipping methods were disabled by "Enable shipping methods" because conditions did not pass
fi: Toimitustavat poistettiin käytöstä, koska ehdot eivät täyttyneet

source: Conditions
fi: Toimitussäännöt

source: Enable / Disable
fi: Ota käyttöön

source: Enable ruleset
fi: Ota käyttöön

source: Ruleset name
fi: Nimi

source: This is the name of the ruleset for your reference.
fi: Nimi joka kuvaa toimitussääntöä, esim. "Estä kirje isoille tuotteille".

source: The following conditions define whether or not actions are run.
fi: Ehdot määrittelevät suoritetaanko toiminnot.

source: Add Condition
fi: Lisää ehto

source: Remove Selected
fi: Poista valitut

source: More conditions available in <a href="%s" target="_blank">the Pro version</a>.
fi: Lisää ehtoja saatavilla <a href="%s">Pro-versiossa</a>.

source: Actions
fi: Toiminnot

source: Actions which are run if all conditions pass.
fi: Toiminnot jotka ajetaan, jos kaikki ehdot täyttyvät.

source: Add Action
fi: Lisää toiminto

source: <strong>Enable shipping methods</strong>: Shipping methods will be enabled if all conditions pass. If conditions do not pass, shipping methods will be disabled.
fi: <strong>Näytä toimitustavat</strong>: valitut toimitustavat näytetään kassalla, jos kaikki ehdot täyttyvät. Jos ehdot eivät täyty, toimitustapoja ei näytetä kassalla.

source: <strong>Disable shipping methods</strong>: Shipping methods will be disabled if all conditions pass.
fi: <strong>Poista toimitustavat</strong>: valittuja toimitustapoja ei näytetä kassalla, jos kaikki ehdot täyttyvät.

source: Save changes
fi: Tallenna muutokset

source: highest
fi: suurin

source: lowest
fi: pienin

source: Subtotal includes coupons
fi: Välisumma sisältää alennuskoodit

source: Postcodes containing wildcards (e.g. CB23*) or fully numeric ranges (e.g. <code>90210...99000</code>) are also supported.
fi: Jokerimerkkejä sisältävät postikoodit (esim. CB23*) tai numerovälit (esim. 90210...99000) ovat tuettuina.

source: Shipping methods
fi: Toimitustavat

source: Custom "no shipping methods available" message
fi: "Ei toimitustapoja saatavilla" viesti

source: Shipping notice
fi: Viesti toimituksesta

source: Add ruleset
fi: Lisää toimitussääntö

source: Rulesets
fi: Toimitussäännöt

source: Ruleset
fi: Toimitussääntö

source: Edit
fi: Muokkaa

source: Delete
fi: Poista

source: No rulesets defined yet.
fi: Ei toimitussääntöjä.

source: Disable all
fi: Poista käytöstä

source: Disable all rulesets
fi: Poista kaikki toimitussäännöt käytöstä

source: Helpful for finding out if Conditional Shipping or another plugin is affecting shipping methods for troubleshooting.
fi: Poistamalla kaikki toimitussäännöt käytöstä voit testata, vaikuttaako Toimitussäännöt vai jokin toinen lisäosa toimitustapoihin.

source: Debug mode
fi: Debug-tila

source: Debug mode shows passed conditions and which actions were run in the checkout.
fi: Debug-tila näyttää kassalla tarkemmat tiedot ajetuista toimitussäännöistä.

source: <code>Enable shipping methods - %1$s</code> in multiple rulesets
fi: <code>Näytä toimitustavat - %1$s</code> useassa eri toimitussäännössä

source: You have <code>Enable shipping methods - %1$s</code> in multiple rulesets (%2$s). <code>Enable shipping methods</code> will disable the methods if conditions do not pass. It can cause unexpected behaviour when used in multiple rulesets for the same shipping method (<code>%1$s</code>).
fi: Useammassa eri toimitussäännössä (%2$s) on <code>Näytä toimitustavat - %1$s</code>. <code>Näytä toimitustavat</code> piilottaa toimitustavat, jos ehdot eivät täyty. Se voi toimia epäloogisesti, kun sitä käytetään useammassa toimitussäännössä samalle toimitustavalle (<code>%1$s</code>).

source: How to fix
fi: Korjaus

source: Check if you can use <code>Disable shipping methods</code> instead. It's usually easier to work with.
fi: Tarkista onko mahdollista käyttää <code>Poista toimitustavat</code>. Se on yleensä helpompi saada toimimaan oikein.

source: Remove <code>Enable shipping methods - %s</code> from all but one ruleset.
fi: Poista <code>Näytä toimitustavat - %s</code> kaikista paitsi yhdestä toimitussäännöstä.

source: <code>%s</code> disabled in the shipping zone
fi: <code>%s</code> poistettu käytöstä toimitusvyöhykkeessä

source: You have <code>%1$s - %2$s</code> in %3$s but <code>%2$s</code> is disabled in <a href="%4$s" target="_blank">the shipping zone</a>. Conditional Shipping can only process shipping methods which are enabled.
fi: Toimitussäännössä %3$s on <code>%1$s - %2$s</code>, mutta kyseinen toimitustapa on pois päältä <a href="%4$s">toimitusvyöhykkeessä</a>. Toimitussäännöt-lisäosa voi käsitellä ainoastaan toimitustapoja, jotka ovat päällä toimitusvyöhykkeissä.

source: Enable <code>%s</code> in <a href="%s" target="_blank">the shipping zone</a>
fi: Aktivoi <code>%s</code> <a href="%s" target="_blank">toimitusvyöhykkeessä</a>

source: Remove <code>%1$s - %2$s</code> from %3$s.
fi: Poista <code>%1$s - %2$s</code> toimitussäännöstä %3$s.

source: Conditional Shipping Debug
fi: Toimitussäännöt debug

source: No rulesets were run.
fi: Yhtään toimitussääntöä ei ajettu.

source: Fail
fi: Epäonnistui

source: Pass
fi: Onnistui

source: No actions were run for this ruleset
fi: Yhtään toimintoa ei ajettu tälle toimitussäännölle

source: Disable shipping method %s
fi: Poista toimitustapa %s käytöstä

source: of all products
fi: kaikkien tuotteiden

source: of products in a shipping class
fi: toimitusluokan tuotteiden

source: of products NOT in a shipping class
fi: EI toimitusluokan tuotteiden

source: Set shipping method price
fi: Aseta toimitustavan hinta

source: Increase shipping method price
fi: Lisää toimitustavan hintaa

source: Decrease shipping method price
fi: Vähennä toimitustavan hintaa

source: Set custom no shipping message
fi: Aseta "ei toimitustapoja" viesti

source: Set shipping notice
fi: Lisää viesti toimituksesta kassalle

source: Number of Items
fi: Ostoskorin tuotteiden lukumäärä

source: Shipping Classes
fi: Toimitusluokat

source: Categories
fi: Kategoriat

source: Product Attributes
fi: Tuoteominaisuudet

source: Coupons
fi: Alennuskoodit

source: Product Measurements
fi: Tuotteen mitat

source: Weight (%s)
fi: Paino (%s)

source: Height (%s)
fi: Korkeus (%s)

source: Length (%s)
fi: Pituus (%s)

source: Width (%s)
fi: Leveys (%s)

source: Customer
fi: Asiakas

source: Logged in / out
fi: Kirjautunut sisään / ulos

source: Role
fi: Rooli

source: Billing Address
fi: Laskutusosoite

source: Postcode (billing)
fi: Postinumero (laskutus)

source: State (billing)
fi: Osavaltio (laskutus)

source: Country (billing)
fi: Maa (laskutus)

source: Shipping Address
fi: Toimitusosoite

source: Postcode (shipping)
fi: Postinumero (toimitus)

source: State (shipping)
fi: Osavaltio (toimitus)

source: Country (shipping)
fi: Maa (toimitus)

source: Misc
fi: Muut

source: Weekday
fi: Viikonpäivä

source: Time
fi: Kellonaika

source: greater than
fi: suurempi kuin

source: greater than or equal
fi: suurempi tai yhtä suuri kuin

source: less than
fi: pienempi kuin

source: less than or equal
fi: pienempi tai yhtä suuri kuin

source: includes
fi: sisältää

source: includes (exclusive)
fi: sisältää ainoastaan

source: excludes
fi: ei sisällä

source: all present
fi: sisältää kaikki

source: is
fi: on

source: is not
fi: ei ole

source: is not empty
fi: ei ole tyhjä

source: is empty
fi: on tyhjä

source: contains
fi: sisältää

source: logged in
fi: kirjautunut sisään

source: logged out
fi: kirjautunut ulos

source: Cart
fi: Ostoskori

source: Subtotal
fi: Välisumma

source: Products
fi: Tuotteet

source: Package Measurements
fi: Paketin mitat

source: Total Weight (%s)
fi: Kokonaispaino (%s)

source: Total Height (%s)
fi: Kokonaiskorkeus (%s)

source: Total Length (%s)
fi: Kokonaispituus (%s)

source: Total Width (%s)
fi: Kokonaisleveys (%s)

source: Total Volume (%s&sup3;)
fi: Kokonaistilavuus (%s&sup3;)

source: Disable shipping methods
fi: Poista toimitustavat

source: Enable shipping methods
fi: Näytä toimitustavat

source: - All coupons -
fi: - Kaikki alennuskoodit -

source: - Free shipping coupons -
fi: - Kaikki ilmaisen toimituksen koodit -
